-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 114.132.41.159    Database: school
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `personality`
--

DROP TABLE IF EXISTS `personality`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `personality` (
  `id` int NOT NULL,
  `question` varchar(255) DEFAULT NULL,
  `optionA` varchar(255) DEFAULT NULL,
  `optionB` varchar(255) DEFAULT NULL,
  `score` char(2) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `personality`
--

LOCK TABLES `personality` WRITE;
/*!40000 ALTER TABLE `personality` DISABLE KEYS */;
INSERT INTO `personality` VALUES (1,'当你某日想去某个地方，你会____？','计划好将做的事情以及何时做','什么都不想就去','JP'),(2,'如果你是一位老师，你愿教____？','涉及事实的课程','涉及理论的课程','SN'),(3,'你通常是____？','一个善于交际的人','安静缄默的人','EI'),(4,'你喜欢____？','事先安排好约会，聚会等','只要时机恰当就无拘无束地做任何有趣的事','JP'),(5,'你通常和____相处得更好？','现实的人','想象力丰富的人','SN'),(6,'当你和一群人在一起时，你会____？','参加大家的谈话','只同你熟知的人单独谈话','EI'),(7,'往往，你是____？','情感驾驭理智','理智驾驭情感','FT'),(8,'你更喜欢____做多数事情？','有计划地','即兴时','JP'),(9,'你愿意自己被认为是一个____？','善于动手的人','善于创意的人','SN'),(10,'在大群体中，你常更多地____？','介绍他人','由别人来介绍你','EI'),(11,'按日程表办事____？','正合你意','束缚了你','FT'),(12,'你更喜欢____？','务实且有丰富常识的人','头脑灵活的人','SN'),(13,'你觉得通常别人要花费____？','一小段时间来了解你','很久来了解你','EI'),(14,'被称为____是更高的赞赏？','感性的人','一贯理性的人','FT'),(15,'对于制定周末计划，你觉得____？','很有必要','没必要','JP'),(16,'你愿把____作为朋友？','脚踏实地的人','常有新观点的人','SN'),(17,'多数时候，你倾向于____？','同他人在一起','独处','EI'),(18,'日常工作中，你喜欢____？','通常先安排好工作并加以完成，以免压力过大','在时间紧迫的情况下争分夺秒地工作','JP'),(19,'当你为了消遣而阅读时，你____？','喜欢作者确切地表达其意思','欣赏奇特新颖的表达方式','SN'),(20,'你能否____？','只要愿意就能轻松地同几乎任何人说个没完','只能在特定场合下或同特定的人才愿意讲许多话','EI'),(21,'你更倾向于____？','感性地做事','依逻辑行事','FT'),(22,'当有一项特殊工作时，你会____？','在开始前精心组织策划','在工作进行中找出必要环节','JP'),(23,'做很多人都会做的事情时，你喜欢____？','按惯例做','按自己独创的方式做','SN'),(24,'你新认识的人____说出你的兴趣所在？','马上就能','只有当他们真正了解你之后才能','EI'),(25,'在计划一次旅行时，你更喜欢____？','事先就知道在大部分日子所将做的事情','在多数情况下随心所欲地行事','JP'),(26,'多数人认为你____？','非常坦率','不太把自己的事情告诉别人','EI'),(27,'在以下各对词中，你更倾向于哪一个？','事实','观点','SN'),(28,'在以下各对词中，你更倾向于哪一个？','热忱','坚决','FT'),(29,'在以下各对词中，你更倾向于哪一个？','切实','创新','SN'),(30,'在以下各对词中，你更倾向于哪一个？','有计划','随意','JP'),(31,'在以下各对词中，你更倾向于哪一个？','实在','抽象','SN'),(32,'在以下各对词中，你更倾向于哪一个？','感觉','思考','FT'),(33,'在以下各对词中，你更倾向于哪一个？','已知的','新颖的','SN'),(34,'在以下各对词中，你更倾向于哪一个？','感性','理性','FT'),(35,'在以下各对词中，你更倾向于哪一个？','安排好的','不受限制的','JP'),(36,'在以下各对词中，你更倾向于哪一个？','热情','安静','EI'),(37,'在以下各对词中，你更倾向于哪一个？','温柔','坚硬','FT'),(38,'在以下各对词中，你更倾向于哪一个？','陈述','观念','SN'),(39,'在以下各对词中，你更倾向于哪一个？','慈悲心肠','意志坚强','FT'),(40,'在以下各对词中，你更倾向于哪一个？','事实的','理论的','SN'),(41,'在以下各对词中，你更倾向于哪一个？','很多朋友','少许朋友','EI'),(42,'在以下各对词中，你更倾向于哪一个？','系统的','自发的','JP'),(43,'在以下各对词中，你更倾向于哪一个？','确定','推测','SN'),(44,'在以下各对词中，你更倾向于哪一个？','宽容','坚定','FT'),(45,'在以下各对词中，你更倾向于哪一个？','必然性','可能性','SN'),(46,'在以下各对词中，你更倾向于哪一个？','动之以情','晓之以理','FT'),(47,'在以下各对词中，你更倾向于哪一个？','健谈','缄默','EI'),(48,'在以下各对词中，你更倾向于哪一个？','温和','力量','FT'),(49,'在以下各对词中，你更倾向于哪一个？','现实','理想','SN'),(50,'在以下各对词中，你更倾向于哪一个？','好心的','称职的','FT'),(51,'在以下各对词中，你更倾向于哪一个？','事实','理论','SN'),(52,'在以下各对词中，你更倾向于哪一个？','系统','随机','JP'),(53,'在以下各对词中，你更倾向于哪一个？','现实的','想象的','SN'),(54,'在以下各对词中，你更倾向于哪一个？','易动情的','客观的','FT'),(55,'在以下各对词中，你更倾向于哪一个？','建造','发明','SN'),(56,'在以下各对词中，你更倾向于哪一个？','感情丰富的','注重实际的','FT'),(57,'在以下各对词中，你更倾向于哪一个？','有序的','随便的','JP'),(58,'在以下各对词中，你更倾向于哪一个？','开朗','文静','EI'),(59,'在以下各对词中，你更倾向于哪一个？','认同','分析','FT'),(60,'在以下各对词中，你更倾向于哪一个？','事实的','想象的','SN'),(61,'在以下各对词中，你更倾向于哪一个？','祝福','利益','FT'),(62,'在以下各对词中，你更倾向于哪一个？','详实','概括','SN'),(63,'在以下各对词中，你更倾向于哪一个？','决定','冲动','JP'),(64,'在以下各对词中，你更倾向于哪一个？','制作','创造','SN'),(65,'在以下各对词中，你更倾向于哪一个？','热情','客观','FT'),(66,'在以下各对词中，你更倾向于哪一个？','实用的','迷人的','SN'),(67,'在以下各对词中，你更倾向于哪一个？','体谅的','公正的','FT'),(68,'在以下各对词中，你更倾向于哪一个？','爱交际','爱文静','EI'),(69,'在以下各对词中，你更倾向于哪一个？','敏感','合理','FT'),(70,'在以下各对词中，你更倾向于哪一个？','制造','设计','SN'),(71,'在以下各对词中，你更倾向于哪一个？','有同情心','有逻辑头脑','FT'),(72,'在以下各对词中，你更倾向于哪一个？','公开的','私人的','EI'),(73,'在以下各对词中，你更倾向于哪一个？','同情怜悯','深谋远虑','FT'),(74,'通常你更喜欢____？','提前安排好业余活动','即兴地做事情','JP'),(75,'你觉得被许多人围着____？','让你感到更有精神','常让你精力衰竭','EI'),(76,'多数情况下，你更喜欢____？','按日程表办事','顺其自然','JP'),(77,'在聚会中，你____？','总是玩得很开心','有时觉得无趣','EI'),(78,'作决定时，对于你来说更重要的是____？','考虑人们的感受和观点','权衡事实','FT'),(79,'你喜欢____？','事先很早就作好准备','看清事态如何发展再作计划','JP'),(80,'别人____了解你？','很容易','很难','EI'),(81,'你喜欢的处事方式是____？','坚持那些已经有效的方法','分析哪些仍有错并挑战未解决的问题','SN'),(82,'你觉得自己更偏向于是一个____？','有组织性的人','自发性的人','JP'),(83,'你____？','只要愿意，就能和几乎任何一个人谈个没完','只同和自己有共同兴趣的人才能长时间的交谈','EI'),(84,'你愿在一个____老板（老师）手下工作（学习）？','脾气好，但前后不一致','对人严厉，但有条理','FT'),(85,'你更喜欢按照____做大多数事情？','已定的日程表','当天的感觉','JP'),(86,'在聚会中，你____？','自己聊得多','听别人聊得多','EI'),(87,'通常，你更喜欢上涉及____的课程？','具体内容','概念和原则','SN'),(88,'当你开始了一项必须在一周内完成的大项目时，你会____？','花时间列出所要做的事情及其先后次序','直接开始','JP'),(89,'在社交场合中，你通常觉得____？','很容易同大多数人长时间谈话','同某些人很难开展和维持长时间的谈话','EI'),(90,'被称为____是更高的赞赏？','富有同情心','有竞争力','FT'),(91,'你觉得按计划行事____？','多数时候是有帮助的适宜的','有时必要，便令人不爽','JP'),(92,'你通常____？','同大家打成一片','倾向于独处','EI'),(93,'总的来说，要完成一项重大任务，你倾向于____？','开始先确定每一个步骤','边做边考虑必须完成的事','JP');
/*!40000 ALTER TABLE `personality` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-16 15:57:16
